user-config.el
;;(load-directory "~/.spacemacs.d/my-lisp")
(global-linum-mode t)
(global-set-key (kbd "M-v") 'yank)

(defun spacemacs//linum-update-window-scale-fix (win)
  "Fix linum for scaled text in the window WIN."
  (set-window-margins win 6))

(evil-ex-define-cmd "q" 'kill-this-buffer)
;; Need to type out :quit to close emacs
(evil-ex-define-cmd "quit" 'evil-quit)

(unbind-key (kbd "C-u") evil-normal-state-map)

;; org mode
;; https://stackoverflow.com/questions/11670654/how-to-resize-images-in-org-mode
;; (setq-default dotspacemacs-configuration-layers
;;               '(
;;                 (org :variables org-projectile-file "~/Dropbox/orgfiles/tasks.org")
;;                 ))
;; (setq-default dotspacemacs-configuration-layers
;;               '((org :variables org-enable-github-support t)))
(add-hook 'org-mode-hook 'turn-on-auto-fill)

;;The following code causes the error:
;;Error (use-package): org-projectile/:config: Symbol’s function definition is void: org-projectile:per-repo
;; (with-eval-after-load 'org-agenda
;;   (require 'org-projectile)
;;   (push (org-projectile:todo-files) org-agenda-files))

(load-file "~/.my-elips/org.el")

;; (setq org-descriptive-links nil)

(require 'ess-site)
(setq  inferior-julia-program-name "/Applications/Julia-1.4.app/Contents/Resources/julia/bin/julia")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (julia . t)
   (shell . t)
   (python . t)
   ))

(setq
 org-export-babel-evaluate nil
 org-confirm-python-evaluate nil
 org-confirm-babel-evaluate nil
 org-confirm-C++-evaluate nil
 )

(setq org-present-text-scale 2)

(eval-after-load "org-present"
  '(progn
     (add-hook 'org-present-mode-hook
               (lambda ()
                 (org-present-big)
                 (org-display-inline-images)
                 (org-present-hide-cursor)
                 (org-present-read-only)
                 ;;(toggle-frame-fullscreen)
                 ))
     (add-hook 'org-present-mode-quit-hook
               (lambda ()
                 (org-present-small)
                 (org-remove-inline-images)
                 (org-present-show-cursor)
                 (org-present-read-write)
                 ;;(toggle-frame-fullscreen)
                 ))))

(require 'yasnippet)
(yas/load-directory "~/.emacs.d.bk/snippets")
;; (setq yas-triggers-in-field t)
;; (yas/initialize)
;; (yas-minor-mode 1)

;; (setq-default dotspacemacs-configuration-layers
;; 	'((mu4e :variables
;; 		mu4e-installation-path "/usr/local/Cellar/mu/1.2.0_1/share/emacs/site-lisp")))
;; (load-file "~/.spacemacs.d/my-lisp/mail.el")
;; (load-file "~/.spacemacs.d/my-lisp/mininum.el")
;; (load-file "~/.my-elips/mail2.el")

(require 'mu4e)
(setq mail-user-agent 'mu4e-user-agent ;; use mu4e for e-mail in emacs
      ;; for mbsync, when move a message to All Mail as archiving
      mu4e-change-filenames-when-moving t
      mu4e-view-show-addresses t
      mu4e-maildir "~/Maildir"
      mu4e-get-mail-command "mbsync umd"
      mu4e-attachment-dir "~/Documents/MailAttachments"
      mu4e-update-interval 60
      )

(setq mu4e-html2text-command
      "textutil -stdin -format html -convert txt -stdout")

;; don't keep message buffers around
(setq message-kill-buffer-on-exit t)

(setq
 sendmail-program "/usr/local/bin/msmtp"
 message-sendmail-f-is-evil t
 message-sendmail-extra-arguments '("--read-envelope-from")
 ;; send-mail-function 'smtpmail-send-it
 ;; message-send-mail-function 'message-send-mail-with-sendmail
 message-send-mail-function 'smtpmail-send-it
 user-full-name "ChongChong He"
 user-mail-address "che1234@umd.edu"
 smtpmail-smtp-user "che1234@umd.edu"
 smtpmail-default-smtp-server "smtp.gmail.com"
 smtpmail-smtp-server "smtp.gmail.com"
 smtpmail-smtp-service 587
 ;; smtpmail-stream-type 'starttls
 starttls-use-gnutls t
 smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
 ;; smtpmail-auth-credentials (expand-file-name "~/.authinfo.gpg")
 smtpmail-debug-info t
 mu4e-compose-keep-self-cc t
 mu4e-compose-dont-reply-to-self nil
 ;; smtpmail-auth-credentials '(("smtp.gmail.com" 587 "che1234@umd.edu" nil))
 ;; testing: removing all the folder def since I don't need
 ;; it. Later will set folder shortcuts
 mu4e-trash-folder "/umd/trash"
 mu4e-sent-folder "/umd/[Gmail].All Mail"
 mu4e-refile-folder "/umd/[Gmail].All Mail"
 mu4e-drafts-folder "/umd/[Gmail].Drafts"
 ;; don't save message to Sent Messages, IMAP takes care of this
 mu4e-maildir-shortcuts '( ("/umd/INBOX"               . ?i)
                           ("/umd/[Gmail].Sent Mail"   . ?s)
                           ;; ("/umd/trash"               . ?t)
                           ("/umd/[Gmail].Drafts"      . ?d)
                           ("/umd/[Gmail].Starred"     . ?*)
                           ("/umd/[Gmail].All Mail"    . ?a)
                           ("/umd/f.Reference"         . ?r)
                           ("/umd/f.Followup"          . ?f)
                           ("/umd/f.Todo"              . ?t)
                         )
 )

(add-hook 'mu4e-compose-mode-hook
          (defun my-add-bcc ()
            "Add a cc: header."
            (save-excursion (message-add-header "Cc: che1234@umd.edu\n"))))

;; ;; from https://www.djcbsoftware.nl/code/mu/mu4e/Compose-hooks.html
;; (add-hook 'mu4e-compose-mode-hook
;;           (lambda()
;;             (let* ((ctx (mu4e-context-current))
;;                    (name (if ctx (mu4e-context-name ctx))))
;;               (when name
;;                 (cond
;;                  ((string= name "astro")
;;                   (save-excursion (message-add-header "Cc: chongchong@astro.umd.edu\n")))
;;                  ((string= name "terpmail")
;;                   (save-excursion (message-add-header "Cc: che1234@terpmail.umd.edu\n")))
;;                  ((string= name "umd")
;;                   (save-excursion (message-add-header "Cc: che1234@umd.edu\n")))
;; 		 )))))

(defun htmlize-and-send ()
  "When in an org-mu4e-compose-org-mode message, htmlize and send it."
  (interactive)
  (when (member 'org~mu4e-mime-switch-headers-or-body post-command-hook)
    (org-mime-htmlize)
    (org-mu4e-compose-org-mode)
    (message-send-and-exit)))
