user-config.org
*** Send-delay (not using)

**Not using**
Allowing to schedule mails to be sent at a later time. Thus enabling
the ability to “undo send” mails.

#+begin_src emacs-lisp :tangle no
  (require 'mu4e-send-delay)
  (mu4e-send-delay-setup)
  (add-hook 'mu4e-main-mode-hook 'mu4e-send-delay-initialize-send-queue-timer)

  (add-hook 'mu4e-main-mode-hook (lambda ()
                                   (define-key mu4e-compose-mode-map
                                     (kbd "C-c C-c")
                                     'mu4e-send-delay-send-and-exit)))
  (setq mu4e-send-delay-default-delay "1m")
#+end_src

*** Header of reply

Message citation with date and time:
#+begin_src emacs-lisp
  (setq message-citation-line-function 'message-insert-formatted-citation-line)
  (setq message-citation-line-format "On %a, %b %d %Y at %R, %f wrote:\n")
#+end_src
*** Notification

#+begin_src emacs-lisp
  (setq mu4e-enable-notifications t)
  (with-eval-after-load 'mu4e-alert
    ;; Enable Desktop notifications
    ;; (mu4e-alert-set-default-style 'notifications)) ; For Linux.
    ;; (mu4e-alert-set-default-style 'libnotify))  ; Alternative for Linux
    (mu4e-alert-set-default-style 'notifier))   ; For macOS (through the
                                                ; terminal notifier app).
    ;; (mu4e-alert-set-default-style 'growl))      ; Alternative for macOS.
#+end_src

** Latex

#+begin_src emacs-lisp
  (setq TeX-auto-save t)
  (add-hook 'LaTeX-mode-hook 'hs-minor-mode)
  (add-hook 'LaTeX-mode-hook 'outline-minor-mode)
  (setq TeX-PDF-mode t)	      ;; Compile documents to PDF by default
  ;; The following two lines make forward syncing possible. Tested on 2020-02-17
  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
  (setq TeX-view-program-list
        '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))

  ;; CDLaTeX: bug, won't recognize multiple files if turned on
  ;; (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
  ;; Make emacs aware of multi-file projects: do not need on spacemacs. not working when cdlatex is on
  ;; (setq-default TeX-master nil)
  (electric-pair-mode)
  (add-hook 'LaTeX-mode-hook
            '(lambda ()
               (define-key LaTeX-mode-map (kbd "$") 'self-insert-command)
               ))

  ;; (setq TeX-parse-self t)
  ;; ;; (add-hook 'latex-mode-hook 'turn-on-cdlatex)   ; with Emacs latex mode
  ;; (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  ;; (setq reftex-plug-into-AUCTeX t)
  ;; ;; (setq reftex-default-bibliography '("/Users/chongchonghe/Documents/bib_tmp.bib"))
  ;; ;; (setq helm-bibtex-bibliography '("/Users/chongchonghe/Documents/bib_tmp.bib"))

  ;; (setq TeX-source-correlate-start-server t)
  ;; ;;
  ;; (setq TeX-source-correlate-mode t) ; ?
  ;; (setq TeX-source-correlate-method 'synctex) ; ?
#+end_src

** Elfeed
   
[[https://github.com/skeeto/elfeed][Elfeed]] is a web feeds client that supports both Atom and RSS feeds.

*** User manual

References: 
- https://www.spacemacs.org/layers/+web-services/elfeed/README.html
- 
  
Shortcuts:
| Key Binding    | Description                                       |
|----------------+---------------------------------------------------|
| ~SPC a f~      | start elfeed                                      |
| ~gr~           | update all the feeds                              |
| ~gu~           | unjam elfeed if it is slow due to slow connection |
| ~w/W~          | start/stop web server                             |
| ~m~            | toggle tag star                                   |
| ~s~            | update the search filter ([[https://github.com/skeeto/elfeed#filter-syntax][filter syntax]])          |
| ~c~            | clear the search filter                           |
| ~b~            | open url in browser                               |
| ~r/u~, ~+/-~   | mark as read/unread                               |
| ~clear filter~ | set filter to default                             |

