user-config.el

(setq message-citation-line-function 'message-insert-formatted-citation-line)
(setq message-citation-line-format "On %a, %b %d %Y at %R, %f wrote:\n")

(setq mu4e-enable-notifications t)
(with-eval-after-load 'mu4e-alert
  ;; Enable Desktop notifications
  ;; (mu4e-alert-set-default-style 'notifications)) ; For Linux.
  ;; (mu4e-alert-set-default-style 'libnotify))  ; Alternative for Linux
  (mu4e-alert-set-default-style 'notifier))   ; For macOS (through the
                                              ; terminal notifier app).
  ;; (mu4e-alert-set-default-style 'growl))      ; Alternative for macOS.

(setq TeX-auto-save t)
(add-hook 'LaTeX-mode-hook 'hs-minor-mode)
(add-hook 'LaTeX-mode-hook 'outline-minor-mode)
(setq TeX-PDF-mode t)	      ;; Compile documents to PDF by default
;; The following two lines make forward syncing possible. Tested on 2020-02-17
(setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
(setq TeX-view-program-list
      '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))

;; CDLaTeX: bug, won't recognize multiple files if turned on
;; (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
;; Make emacs aware of multi-file projects: do not need on spacemacs. not working when cdlatex is on
;; (setq-default TeX-master nil)
(electric-pair-mode)
(add-hook 'LaTeX-mode-hook
          '(lambda ()
             (define-key LaTeX-mode-map (kbd "$") 'self-insert-command)
             ))

;; (setq TeX-parse-self t)
;; ;; (add-hook 'latex-mode-hook 'turn-on-cdlatex)   ; with Emacs latex mode
;; (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
;; (setq reftex-plug-into-AUCTeX t)
;; ;; (setq reftex-default-bibliography '("/Users/chongchonghe/Documents/bib_tmp.bib"))
;; ;; (setq helm-bibtex-bibliography '("/Users/chongchonghe/Documents/bib_tmp.bib"))

;; (setq TeX-source-correlate-start-server t)
;; ;;
;; (setq TeX-source-correlate-mode t) ; ?
;; (setq TeX-source-correlate-method 'synctex) ; ?

(require 'elfeed)
