user-config.org
*** Configs

  Toggle star: (Ref: http://pragmaticemacs.com/emacs/star-and-unstar-articles-in-elfeed/)
  #+begin_src emacs-lisp
    (require 'elfeed)

    (defalias 'elfeed-toggle-star
      (elfeed-expose #'elfeed-search-toggle-all 'star))

    (eval-after-load 'elfeed-search
      '(define-key elfeed-search-mode-map (kbd "m") 'elfeed-toggle-star))

    ;; face for starred articles
    (defface elfeed-search-starred-title-face
      '((t :foreground "#f77"))
      "Marks a starred Elfeed entry.")

    (push '(star elfeed-search-starred-title-face) elfeed-search-face-alist)
  #+end_src

Managing ArXiv RSS Feeds in Emacs: (https://cundy.me/post/elfeed/)

#+begin_src emacs-lisp
  (defun concatenate-authors (authors-list)
    "Given AUTHORS-LIST, list of plists; return string of all authors
  concatenated."
    (mapconcat
     (lambda (author) (plist-get author :name))
     authors-list ", "))

  (defun my-search-print-fn (entry)
    "Print ENTRY to the buffer."

    (let* ((title (or (elfeed-meta entry :title) (elfeed-entry-title entry) ""))
           (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
           (feed (elfeed-entry-feed entry))
           (feed-title
            (when feed
              (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
           (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
           (tags-str (concat "[" (mapconcat 'identity tags ",") "]"))
           (title-width (- (window-width) elfeed-goodies/feed-source-column-width
                           elfeed-goodies/tag-column-width 4))
           (title-column (elfeed-format-column
                          title (elfeed-clamp
                                 elfeed-search-title-min-width
                                 title-width
                                 title-width)
                          :left))
           (tag-column (elfeed-format-column
                        tags-str 13
                        :left))
           (feed-column (elfeed-format-column
                         feed-title 11
                         :left))
           (entry-authors (concatenate-authors
                           (elfeed-meta entry :authors)))
           (authors-column (elfeed-format-column
                            entry-authors 40
                            :left))
           )

      (if (>= (window-width) (* (frame-width) elfeed-goodies/wide-threshold))
          (progn
            (insert (propertize feed-column 'face 'elfeed-search-feed-face) " ")
            (insert (propertize tag-column 'face 'elfeed-search-tag-face) " ")
            (insert (propertize authors-column
                                'face 'elfeed-search-date-face
                                'kbd-help entry-authors) " ")
            (insert (propertize title 'face title-faces 'kbd-help title))
            )
        (insert (propertize title 'face title-faces 'kbd-help title)))))

  (setq elfeed-search-print-entry-function #'my-search-print-fn)
#+end_src

#+begin_src emacs-lisp :tangle no
  (defun concatenate-authors (authors-list)
    "Given AUTHORS-LIST, list of plists; return string of all authors
  concatenated."
    (mapconcat
     (lambda (author) (plist-get author :name))
     authors-list ", "))

  (defun my-search-print-fn (entry)
    "Print ENTRY to the buffer."
    (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
           (title (or (elfeed-meta entry :title)
                      (elfeed-entry-title entry) ""))
           (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
           (feed-title (when feed
                         (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
           (feed-title-column (elfeed-format-column
                               feed-title 11
                               :right))
           (feed (elfeed-entry-feed entry))
           (feed-title
            (when feed
              (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
           (entry-authors (concatenate-authors
                           (elfeed-meta entry :authors)))
           (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
           ;; (tags-str (mapconcat
           ;;            (lambda (s) (propertize s 'face
           ;;                                    'elfeed-search-tag-face))
           ;;            tags ","))
           (tags-str (concat "[" (mapconcat 'identity tags ",") "]"))
           (title-width (- (window-width) 10
                           elfeed-search-trailing-width))
           (title-column (elfeed-format-column
                          title (elfeed-clamp
                                 elfeed-search-title-min-width
                                 title-width
                                 elfeed-search-title-max-width)
                          :left))
           ;; (authors-width 135)
           (authors-column (elfeed-format-column
                            entry-authors 40
                            :left)))
    
      (insert (propertize feed-title-column
                          'face 'elfeed-search-feed-face) " ")

      (insert (propertize date 'face 'elfeed-search-date-face) " ")
    
      (insert (propertize title-column
                          'face title-faces 'kbd-help title) " ")
    
      (insert (propertize authors-column
                          'face 'elfeed-search-date-face
                          'kbd-help entry-authors) " ")
    
      ;; (when feed-title
      ;;   (insert (propertize entry-authors
      ;; 'face 'elfeed-search-feed-face) " "))
    
      ;; (when entry-authors
      ;;   (insert (propertize feed-title
      ;;                       'face 'elfeed-search-feed-face) " "))
    
      ;; (when tags
      ;;   (insert "(" tags-str ")"))
    
      )
    )
  (setq elfeed-search-print-entry-function #'my-search-print-fn)
#+end_src

#+begin_src emacs-lisp :tangle no
  (defun concatenate-authors (authors-list)
    "Given AUTHORS-LIST, list of plists; return string of all authors
  concatenated."
    (mapconcat
     (lambda (author) (plist-get author :name))
     authors-list ", "))

  (defun my-search-print-fn (entry)
    "Print ENTRY to the buffer."
    (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
           (title (or (elfeed-meta entry :title)
                      (elfeed-entry-title entry) ""))
           (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
           (feed (elfeed-entry-feed entry))
           (feed-title
            (when feed
              (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
           ;; Should use this as a template to set the width of a column
           (feed-title-column (elfeed-format-column
                               feed-title 11
                               :right))
           (entry-authors (concatenate-authors
                           (elfeed-meta entry :authors)))
           (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
           (tags-str (concat "[" (mapconcat 'identity tags ",") "]"))
           ;; (tags-str (mapconcat
           ;;      (lambda (s) (propertize s 'face
           ;;            'elfeed-search-tag-face))
           ;;      tags ","))
           ;; (tags-width 11)
           ;; (tags-column (elfeed-format-column
           ;;               tags-str (elfeed-clamp
           ;;                         elfeed-search-title-min-width
           ;;                         tags-width
           ;;                         elfeed-search-title-max-width)
           ;;               :left))
           ;; (title-width (- (window-width) 10 elfeed-search-trailing-width))
           ;; (title-column (elfeed-format-column
           ;;                title (elfeed-clamp
           ;;                       elfeed-search-title-min-width
           ;;                       title-width
           ;;                       elfeed-search-title-max-width)
           ;;                :left))
           (title-column (elfeed-format-column
                          title 200
                          :left))
           ;; (authors-width 65)
           ;; (authors-column (elfeed-format-column
           ;;                  entry-authors (elfeed-clamp
           ;;                                 elfeed-search-title-min-width
           ;;                                 authors-width
           ;;                                 61)
           ;;                  :left)))
           (authors-column (elfeed-format-column
                            entry-authors 40
                            :left))
           ))
  
    ;; (when entry-authors
    ;;   (insert (propertize feed-title
    ;;                       'face 'elfeed-search-feed-face) " "))
    (insert (propertize feed-title-column
                        'face 'elfeed-search-feed-face) " ")
  
    (insert (propertize date 'face 'elfeed-search-date-face) " ")
  
    ;; I don't need tags in the header because starred item are shown as red
    ;; (insert (propertize tags-column 'face tags-str) " ")
  
    (insert (propertize title-column
                        'face title-faces 'kbd-help title) " ")
  
    (insert (propertize authors-column
                        'face 'elfeed-search-date-face
                        'kbd-help entry-authors) " ")
  
    ;; (when feed-title
    ;;   (insert (propertize entry-authors
    ;; 'face 'elfeed-search-feed-face) " "))
  
    )
  (setq elfeed-search-print-entry-function #'my-search-print-fn)
#+end_src

