user-config.el

;; ;; Use cmd key for meta
;; ;; https://superuser.com/questions/297259/set-emacs-meta-key-to-be-the-mac-key
(setq mac-option-key-is-meta nil
      mac-command-key-is-meta t
      mac-command-modifier 'meta
      mac-option-modifier 'super)
;; ;; make swithing windows easier
(global-set-key (kbd "M-j") 'evil-window-down)
(global-set-key (kbd "M-k") 'evil-window-up)
(global-set-key (kbd "M-h") 'evil-window-left)
(global-set-key (kbd "M-l") 'evil-window-right)
;; trying bind-key.el: https://emacs.stackexchange.com/questions/352/how-to-override-major-mode-bindings

;; ;; not working
;; (use-package bind-key
;;   :config
;;   (bind-keys*
;;    ("M-h" . 'evil-window-left)
;;    ("M-l" . 'evil-window-right)
;;    ("M-j" . 'evil-window-up)
;;    ("M-k" . 'evil-window-down)
;;    )
;; )
;; ;; not working
;; (define-key org-mode-map (kbd "M-j") nil)
;; (global-set-key (kbd "C-j") 'windmove-down)
;; (global-set-key (kbd "M-<up>") 'windmove-up)
;; (global-set-key (kbd "M-<right>") 'windmove-right)
;; (global-set-key (kbd "M-<left>") 'windmove-left)
;; Abandoned. Not working in org mode under spacemacs
;; (global-set-key (kbd "M-j") 'windmove-down)
;; (global-set-key (kbd "M-k") 'windmove-up)
;; (global-set-key (kbd "M-h") 'windmove-left)
;; (global-set-key (kbd "M-l") 'windmove-right)
;; (global-set-key (kbd "s-x") nil) ; my habits causes mistake
;; ;; https://orgmode.org/manual/Conflicts.html
;; ;; Make windmove work in Org mode:
;; (add-hook 'org-shiftup-final-hook 'windmove-up)
;; (add-hook 'org-shiftleft-final-hook 'windmove-left)
;; (add-hook 'org-shiftdown-final-hook 'evil-windmove-down)
;; (add-hook 'org-shiftright-final-hook 'windmove-right)
;; (define-key org-mode-map (kbd "M-h") 'windmove-left) ;; org conflicts
;; ;; Keybindings
;; (define-key evil-normal-state-map (kbd "M-h") #'evil-window-left)
;; (define-key evil-normal-state-map (kbd "M-j") #'evil-window-down)
;; (define-key evil-normal-state-map (kbd "M-k") #'evil-window-up)
;; (define-key evil-normal-state-map (kbd "M-l") #'evil-window-right)

(require 'atomic-chrome)
(atomic-chrome-start-server)
